Ran Plan for project: `elk` dir: `deploy/elk/terraform` workspace: `tf-atlantis-elk`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.prometheus will be created
+ resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # yaml-language-server: $schema=values.schema.json
                # Default values for prometheus.
                # This is a YAML-formatted file.
                # Declare variables to be passed into your templates.
                
                rbac:
                  create: true
                
                podSecurityPolicy:
                  enabled: false
                
                imagePullSecrets: []
                # - name: "image-pull-secret"
                
                ## Define serviceAccount names for components. Defaults to component's fully qualified name.
                ##
                serviceAccounts:
                  server:
                    create: true
                    name: ""
                    annotations: {}
                
                    ## Opt out of automounting Kubernetes API credentials.
                    ## It will be overriden by server.automountServiceAccountToken value, if set.
                    # automountServiceAccountToken: false
                
                ## Additional labels to attach to all resources
                commonMetaLabels: {}
                
                ## Monitors ConfigMap changes and POSTs to a URL
                ## Ref: https://github.com/prometheus-operator/prometheus-operator/tree/main/cmd/prometheus-config-reloader
                ##
                configmapReload:
                  ## URL for configmap-reload to use for reloads
                  ##
                  reloadUrl: ""
                
                  ## env sets environment variables to pass to the container. Can be set as name/value pairs,
                  ## read from secrets or configmaps.
                  env: []
                    # - name: SOMEVAR
                    #   value: somevalue
                    # - name: PASSWORD
                    #   valueFrom:
                    #     secretKeyRef:
                    #       name: mysecret
                    #       key: password
                    #       optional: false
                
                  prometheus:
                    ## If false, the configmap-reload container will not be deployed
                    ##
                    enabled: true
                
                    ## configmap-reload container name
                    ##
                    name: configmap-reload
                
                    ## configmap-reload container image
                    ##
                    image:
                      repository: quay.io/prometheus-operator/prometheus-config-reloader
                      tag: v0.76.0
                      # When digest is set to a non-empty value, images will be pulled by digest (regardless of tag value).
                      digest: ""
                      pullPolicy: IfNotPresent
                
                    ## config-reloader's container port and port name for probes and metrics
                    containerPort: 8080
                    containerPortName: metrics
                
                    ## Additional configmap-reload container argu
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.